[
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-27",
   "customer_name": "Paul Skelly ",
   "rating": 4,
   "review_summary": "Open water swim",
   "review": "Nice location, friendly people. Lake was smaller than I expected "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-15",
   "customer_name": "Pam Faulkner",
   "rating": 4,
   "review_summary": "Paddleboarding experience ",
   "review": "Thought the tuition was rather short & not put over very well, also was under the impression that an instructor would be out on lake to offer advice. Beautiful setting, worth the money but a bit more interaction from instructor would have made it better."
 },
 {
   "product": "SUP - Bring Your Own Gear",
   "review_date": "2023-09-07",
   "customer_name": "Elizabeth McGeown",
   "rating": 4,
   "review_summary": "Excellent but a little pricey",
   "review": "Moira lakes is a fantastic spot to enjoy our new SUP in a safe and organised setting. My only comment would be as a family of four bringing all our own equipment it feels unnecessary to charge £5 per extra person on top of the £10 charge for board +1. Other than this I couldn’t fault it- looking forward to the introduction of private changing facilities and the inflatable obstacle course which will be a great local facility to have."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-24",
   "customer_name": "John Woodlock",
   "rating": 4,
   "review_summary": "Great activity and value for money",
   "review": "Did the SUP with my niece and nephew. This is our second time here  so it looks like becoming a regular thing. We all enjoyed ourselves tremendously. The staff were also great. The only downer is the condition of the lane leading to the activity centre which is pretty rough and felt like you were going to get a puncture any second."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-17",
   "customer_name": "Jo",
   "rating": 4,
   "review_summary": "Great swimming spot",
   "review": "Beautiful lake, clear clean water. Even spotted a few fish. Easy to book a swim- just would love that there were more sessions to choose from. Some early morning weekday ones would be great. Definitely recommended it "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-03",
   "customer_name": "Elizabeth  Henderson",
   "rating": 4,
   "review_summary": "Safe swimming ",
   "review": "Lovely safe swimming experience. Good if swimming alone or when sea/ lake conditions not good . Excellent for starting swimming as easy entry and lifeguard on duty . Enjoyed watching the swallows dip in and out of the lake . Shared changing rooms useful on a wet day but showers and toilets adjacent would be welcome . Friendly staff and post swim coffee most welcome . More flexible sessions during week would help - and a proper coffee machine ?? "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-30",
   "customer_name": "..",
   "rating": 4,
   "review_summary": "Love the lakes",
   "review": "I love swimming here- got really stuck in the pond weeds today- they were right up to the surface at points. Hope the lane can re smoothed out abit too down the line as I really enjoy visiting the lakes "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-17",
   "customer_name": "Andy Fleming ",
   "rating": 4,
   "review_summary": "What a hidden treasure on our doorstep!",
   "review": "Cannot believe we’ve just discovered this gem on our doorstep…the lake is so clean, facilities are great ( with the added bonus of free tea/coffee afterwards ), the staff are friendly & helpful, it is so easy to book online & overall is great value for money!Will definitely be regulars & recommend Moira Lakes to our friends "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-05-11",
   "customer_name": "John Woodlock",
   "rating": 4,
   "review_summary": "Great Amenity ",
   "review": "Great place for a swim in a safe environment with lifeguards.  The Stand Up Paddleboarding is also great craic.  Highly recommend a visit there."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-26",
   "customer_name": "Pauline  Fleming ",
   "rating": 5,
   "review_summary": "Excellent",
   "review": "Absolutely!!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-26",
   "customer_name": "Becky  ",
   "rating": 5,
   "review_summary": "Fantastic ",
   "review": "Everything about this place is 10/10. Easy to book and attend. Everyone is really friendly and accommodating. I’ve returned a few times since and had to cancel my last visit last minute- staff have said they will honour my booking next time I wish to attend. Very professional, clean, safe and friendly environment. Would definitely recommend!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-21",
   "customer_name": "Geoff Somerville",
   "rating": 5,
   "review_summary": "Perfect cold water swimming venue",
   "review": "Crystal clear water, friendly and kind staff, superb changing facilities, lovely hot outside shower, it's a perfect cold water swimming venue."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-20",
   "customer_name": "Susan McNickle",
   "rating": 5,
   "review_summary": "Swim",
   "review": "Very friendly and welcoming staff. Met some lovely people there too. Great set up. Highly recommend."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-19",
   "customer_name": "Terry Whyte",
   "rating": 5,
   "review_summary": "Great spot.",
   "review": "Brought granddaughter too cold the water she said, lol. Left after 5 mins. Great friendly  spot, Great facilities."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-10-17",
   "customer_name": "Barbara Stronge",
   "rating": 5,
   "review_summary": "Son's birthday party",
   "review": "We had our son's birthday party here a few weeks ago the kids had an absolute ball. I never knew that it existed until I seen on Facebook Def worth a visit. Staff are super friendly and everything's so well organised "
 },
 {
   "product": "Equinox Sunrise Swim in aid of Aware NI",
   "review_date": "2023-10-17",
   "customer_name": "Anon",
   "rating": 5,
   "review_summary": "Such a lovely morning.",
   "review": "Great wild swim for Aware NI. Had a lovely sauna and croissants and coffee afterwards. Would definitely do again! "
 },
 {
   "product": "Equinox Sunrise Swim in aid of Aware NI",
   "review_date": "2023-10-17",
   "customer_name": "Elizabeth  Henderson ",
   "rating": 5,
   "review_summary": "Sunrise swim",
   "review": "Lovely safe clean swim - for a great cause "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-13",
   "customer_name": "Sharon Carson",
   "rating": 5,
   "review_summary": "Superb facility.",
   "review": "Brilliant setup, very friendly staff, excellent facilities. "
 },
 {
   "product": "Charity Sunset Swim in aid of Action Cancer",
   "review_date": "2023-10-12",
   "customer_name": "Martine Hanna",
   "rating": 5,
   "review_summary": "Great evening great value & lovely people ",
   "review": "Such a welcoming place it was my first time there.  So easy to book on line.  I brought two friends and both really enjoyed the whole evening especially the soup and roll.  A great night enjoyed by all.  I even went back on Saturday morning.Thank you all so much."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-12",
   "customer_name": "Elizabeth  Crummey ",
   "rating": 5,
   "review_summary": "Well deserved 5 stars",
   "review": "If you haven't been here.. you need to visit.. didn't know it existed until a friend coaxed me to try the cold water swimming... Have been twice this week and absolutely love it . Very safe and well run . "
 },
 {
   "product": "Charity Sunset Swim in aid of Action Cancer",
   "review_date": "2023-10-12",
   "customer_name": "Martin  McGrath ",
   "rating": 5,
   "review_summary": "Moira Swim",
   "review": "It was great very friendly "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-11",
   "customer_name": "Carla  Guedes ",
   "rating": 5,
   "review_summary": "100 % 5",
   "review": "Liked everything. NoYes"
 },
 {
   "product": "Charity Sunset Swim in aid of Action Cancer",
   "review_date": "2023-10-10",
   "customer_name": "Patricia  Cowan ",
   "rating": 5,
   "review_summary": "Charity Swim",
   "review": "Loved the whole  experience however would have liked everyone to either start together or staggered  and with a horn or something  to indicate start. Soup and roll was amazing together with commaradier. "
 },
 {
   "product": "Charity Sunset Swim in aid of Action Cancer",
   "review_date": "2023-10-10",
   "customer_name": "R Thornton",
   "rating": 5,
   "review_summary": "Worthwhile Cause",
   "review": "Healthy way to spend an hour while supporting a worthy cause. Hot soup and rolls served afterwards by the friendly organisers. I would do this again and hopefully bring more friends"
 },
 {
   "product": "Charity Sunset Swim in aid of Action Cancer",
   "review_date": "2023-10-10",
   "customer_name": "Mandy Clark",
   "rating": 5,
   "review_summary": "Amazing Swim",
   "review": "First time there, absolutely loved it!  Lovely swim and facilities top class, looking forward to visiting again.  They really looked after us"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-08",
   "customer_name": "Arthur Deane",
   "rating": 5,
   "review_summary": "First Class Venue",
   "review": "The whole experience was great, superb access for people with mobility issues, very clean and inviting and the shower and changing facilities great, especially in wet and cold weather. It would be nice to have the shower closer to the changing rooms especially with the colder weather coming in. Thanks Moira Lakes for such a great facility, not to forget the warm coffee or tea."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-07",
   "customer_name": "Elizabeth Gillespie ",
   "rating": 5,
   "review_summary": "Fantastic centre ",
   "review": "I have been a few times and it is a great spot. Perfect for swimming and so friendly. The tea and coffee afterwards is very much appreciated!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-10-05",
   "customer_name": "Stephanie Gibson",
   "rating": 5,
   "review_summary": "Paddle boarding",
   "review": "Easy to book. First time doing paddling boarding and we all really enjoying it. Very relaxing on the clear water once we found our balance. Water is not deep witch is reassuring for those who are not confident in water. Very friendly Instructors were there in the water too giving tips and keeping everyone safe. Cant wait to go back and spend a bit longer maybe have a picnic afterwards, as its a lovely well kept area with a nice wee beach.  Thank you "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-04",
   "customer_name": "Nichola Lynagh",
   "rating": 5,
   "review_summary": "Loved our first experience of lake swimming and a great welcome by the staff so thank you ",
   "review": "Staff very approachable and helpfulFacilities excellent Lake peaceful and safety is paramount"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-10-04",
   "customer_name": "Shauneen Fegan",
   "rating": 5,
   "review_summary": "Brilliant Party Venue",
   "review": "Moira Lakes was a great day out for my son's 13th Birthday. Everyone had great fun including the adults. They absolutely loved the Paddle Boarding & the pizza afterwards was very tasty. The staff were all very welcoming & helpful.We will definitely return to Moira Lakes"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-03",
   "customer_name": "Margaret Heasley",
   "rating": 5,
   "review_summary": "Open water swimming in Moira lakes ",
   "review": "Friendly staff assistance with all requirements all facilities and equipment clean safe environment for any level  of swimmer over all every experience at Moira lakes is excellent fully recommend to join "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-10-01",
   "customer_name": "IAN HUTCHINGS",
   "rating": 5,
   "review_summary": "Clean Water",
   "review": "Love swimming at Moira Lakes. The water is amazingly clear. You do have to pay to swim there, but for that you get a lifeguard, access to hot showers and a hot drink afterwards. Well worth it in my opinion."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-29",
   "customer_name": "Gillian Love",
   "rating": 5,
   "review_summary": "Open swim ",
   "review": "Absolutely outstanding facilities and Great  value for money will def be back  "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-29",
   "customer_name": "Jill McMahon ",
   "rating": 5,
   "review_summary": "3rd time paddle boarding at Moira Lakes",
   "review": "Another brilliant and fun time paddle boarding. The staff are amazing and we always feel safe as a family meaning we really enjoy every minute we laugh and the kids have such a good time. We can’t wait to go back next spring/summer!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-28",
   "customer_name": "Chrissy Finn",
   "rating": 5,
   "review_summary": "Saturday Stand Up Paddle Boarding",
   "review": "Great experience for our 1st time paddle boarding. Venue is easy to get to, with lots of parking. Staff were very friendly and helpful.Plenty of space in changing rooms. Some hooks for clothes would be useful.Kieran was a great host. Made the group feel at ease. 3 Instructors there to get us set up on the boards and then 2 instructors out on the water at all times.Attended with our young son who struggled with steering the board and instructors were there on hand to help. Our family group was also allowed to try out the large 'group' paddle board. This was an unexpected surprise, which we all enjoyed.Definitely will try paddle boarding again!"
 },
 {
   "product": "Equinox Sunrise Swim in aid of Aware NI",
   "review_date": "2023-09-28",
   "customer_name": "Noleen  O’Neill",
   "rating": 5,
   "review_summary": "Beautiful Solstice Swim",
   "review": "Beautiful swim and for a great charity, lovely cup of tea and croissant afterwards. Thanks Moira Lakes team x"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-22",
   "customer_name": "Nicola  Lawless ",
   "rating": 5,
   "review_summary": "Great Experience ",
   "review": "Great experience at my first open water swimming. Booking was simple, staff were very informative and friendly. Highly recommended this facility. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-21",
   "customer_name": "Marie Anne FORESTER",
   "rating": 5,
   "review_summary": "Challenge yourself and you might be in for a surprise!",
   "review": "This was my second visit to  Moria Lakes, after previously going with a group of friends I ventured this time solo. I surprised myself by staying in twice as long (approx 20 min) and swimming a bit further out.Booking is easy to follow and confirmation and reminder emails are helpful.I have continued to mention my experience and recommend to friends to give it a go. Other users are very friendly, helpful and encouraging."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-21",
   "customer_name": "Nathan Cameron",
   "rating": 5,
   "review_summary": "Great craic",
   "review": "Great craic, great equipment, short safety briefing and cheap price."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-21",
   "customer_name": "xxxxxxxx",
   "rating": 5,
   "review_summary": "Swimming Moira Lakes",
   "review": "Enjoyed swimming in Moira Lakes, site very clean. States warm showers available, would be better if actual overhead shower rather than hand held (more like a hose).Note cats in reception area, not ideal if you are allergic to cats, which I am."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-21",
   "customer_name": "Emma  McCaughey ",
   "rating": 5,
   "review_summary": "Open water swim ",
   "review": "Everything about moira lakes is great!! I went with my auntie for a Saturday morning swim after she had been there the weekend before for her grandsons birthday, it was amazing, the water was so clean and refreshing, the changing facility was good and the cuppa after was just what we needed and all this for £5! I wish I had of went to moira lakes earlier in the summer to enjoy the cold water swims, I have since been after this and will continue until they close for the winter! I definitely look forward to summer next year to enjoy more cold swims!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-19",
   "customer_name": "Brian McNamara",
   "rating": 5,
   "review_summary": "Great experience ",
   "review": "We have been a couple of times and both experiences were excellent. The staff were friendly and very patient with both our boys who have special needs. We only found out about the site late in the year but will definitely be making more use of the facilities next season. Keep up the great work. Brian"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-18",
   "customer_name": "Kate  Baxter",
   "rating": 5,
   "review_summary": "Great fun! ",
   "review": "Great fun experience, instructors were a good resource giving tips and challenges to improve technique. We all enjoyed our trip Nice size lake for beginners, not too daunting. Only slight negative was that you could see into changing rooms through reflective/mirrored glass (we were there for an evening session so it was dark and inside lights on) "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-16",
   "customer_name": "Anne Thompson",
   "rating": 5,
   "review_summary": "Moira Lakes",
   "review": "Great place for swim. Plenty of like minded people there. Very clear water and a wee cuppa after. What’s not to like "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-16",
   "customer_name": "Arthur Brame",
   "rating": 5,
   "review_summary": "Moira Lakes Experience.",
   "review": "An excellent facility, ideal for land bound people who love open water swimming or cold dipping, especially the warm shower and changing rooms not to mention the warm tea or coffee afterwards. The lakes is large enough to cater for the strong swimmers who ca do circuits and the person who just wants  enjoy the cold water and take in the beautiful surrounding, which all makes for a very pleasant  and value fir money experience.Thank you all for providing such a great facility. Arthur."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-15",
   "customer_name": "Al Dorman",
   "rating": 5,
   "review_summary": "Moira Lakes SUP",
   "review": "Fantastic fun many thanks "
 },
 {
   "product": "SUP - Bring Your Own Gear",
   "review_date": "2023-09-15",
   "customer_name": "Helen White",
   "rating": 5,
   "review_summary": "Excellent",
   "review": "Had such an amazing experience paddle boarding yesterday at Moira lakes. Many thanks to Martin and all the staff, who ensured we had a great day, nothing was too much trouble. A beautiful place with great facilities, highly recommend. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-14",
   "customer_name": "Elizabeth  Reynolds",
   "rating": 5,
   "review_summary": "A Great Open Swim",
   "review": "I had a wonderful time at Moira Lakes, open swimming with my niece.I had just booked for a swim but then realised I had forgotten my float. A very friendly member of Staff kindly allowed me to borrow one, on this occasion. My niece and I had a really enjoyable swim followed by a quick outdoor shower, change into dry clothes and a welcome mug of coffee (included in our price of £5) Fabulous value for money. A great experience. We will definitely be back. A big thank you to all the helpful, friendly staff."
 },
 {
   "product": "SUP - Bring Your Own Gear",
   "review_date": "2023-09-14",
   "customer_name": "Judith Baird",
   "rating": 5,
   "review_summary": "Great Experience",
   "review": "Lovely few trips to Moira lakes, beautiful clean water and great facilities."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-14",
   "customer_name": "Anthony Curran",
   "rating": 5,
   "review_summary": "Fun Day out",
   "review": "Excellent family day out staff very good facilities also excellent.Dry viewing area for rest of family and small beach area for children."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-13",
   "customer_name": "Fiona  ",
   "rating": 5,
   "review_summary": "Moira Lakes ",
   "review": "Easy to book and staff friendly and helpful. Loved the feel of the spring water and the beautiful surroundings. My husband doesn't swim but he enjoyed walking around the lake. Have already recommended the lake to a friend, who's now been twice too. Disappointed that you're closing in October as would like to keep coming."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-13",
   "customer_name": "Heather Branagh",
   "rating": 5,
   "review_summary": "Lovely summer evening swim ",
   "review": "Great facilities for an enjoyable swim . Floats available for hire and a must . All very safe and clean . Hot showers available and changing facilities. Easy to book on line Definitely recommend Only criticism lane up to lakes full of potholes "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-13",
   "customer_name": "Michael Gorman",
   "rating": 5,
   "review_summary": "Open Water Swim",
   "review": "Loved the water was so clean and refreshing.Very enjoyable for anybody looking just to cool down or to for a swim.The course is 350 metres the whole way around and is a good exercise for all fitness levels.The only thing I didn't like was the amount of weeds in the bottom of the lake.Would need them removed or scraped out."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-13",
   "customer_name": "Jack Ratcliffe",
   "rating": 5,
   "review_summary": "Great activity for a couples evening out",
   "review": "We loved how refreshing it was on a hot evening. Everything was laid out so simply for booking and arrival. We’ve recommended Moira lakes to everyone we know. Thanks again "
 },
 {
   "product": "Paddle Sports & Water Safety Training",
   "review_date": "2023-09-12",
   "customer_name": "Tina  Robinson ",
   "rating": 5,
   "review_summary": "Water safety training ",
   "review": "The boys really enjoyed the water safety training. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-11",
   "customer_name": "Rhonda Cowieson ",
   "rating": 5,
   "review_summary": "Enjoyable experience ",
   "review": "Just recently started going to Moira Lakes and really enjoy the experience. Booking system is so easy to use and facilities very clean.The complimentary tea/coffee afterwards is a lovely touch."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-11",
   "customer_name": "tim courtney",
   "rating": 5,
   "review_summary": "Fantastic time",
   "review": "Lovely clear water, so much nicer than swimming in a pool. :-)"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-11",
   "customer_name": "Pamela Price",
   "rating": 5,
   "review_summary": "Wonderful, so calming",
   "review": "Definitely recommend it.  So relaxing."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-10",
   "customer_name": "Beverley Downey  ",
   "rating": 5,
   "review_summary": "A peaceful retreat. ",
   "review": "A beautiful peaceful place for a swim in crystal clear water! "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-10",
   "customer_name": "Diane Hanna",
   "rating": 5,
   "review_summary": "Great day fun in the sun ",
   "review": "I have been a few times , keep coming back . What is there not to like . Great place ! Well run ! Yes would recommend to family and friends . My only negative is that the safety talk waited until everyone was there even the people that were late "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-08",
   "customer_name": "Shelagh Reilly",
   "rating": 5,
   "review_summary": "Loved swims in  Moira Lake",
   "review": "I've recently discovered Moira Lakes and have managed to get three swims - so far!Wonderful to have a safe and lovely nearby venue  to enjoy Open Swimming. Loved the glorious weather - keep it up?!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-08",
   "customer_name": "Emma  Critchley ",
   "rating": 5,
   "review_summary": "Fab",
   "review": "Had a lovely afternoon with the family paddle boarding. It was so calm and sheltered, felt very safe for the kids so we could relax and enjoy ourselves. All equipment provided and great quality."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-08",
   "customer_name": "Patricia Forsythe",
   "rating": 5,
   "review_summary": "Super SUP",
   "review": "We had a great day out l, the 2 adults were given some great tips by the guys on the water and the 2 kids had an absolutely fab time! We will definitely be back"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-08",
   "customer_name": "Yolande POWELL",
   "rating": 5,
   "review_summary": "Sunday swim",
   "review": "Moira Lakes is a fantastic resource for anyone who appreciates outdoor swimming. It is a perfect size for this activity and the centre was lively with a buzz about it. Outdoor showers could be revamped and maybe more swim slots made available ? It would be great if there was some way of keeping it open over winter! Overall excellent "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-08",
   "customer_name": "Antonia  Phinnemore ",
   "rating": 5,
   "review_summary": "Who could ask for more?",
   "review": "When it comes to swimming, who could ask for more? Beautiful surroundings, security of a lifeguard and exceptional water to swim in…"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-08",
   "customer_name": "Gil Burns",
   "rating": 5,
   "review_summary": "Brilliant spot!",
   "review": "Over the moon that I’ve found Moira Lakes - excellent - well organised- spotless- a little bit of heaven and easy to book. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-05",
   "customer_name": "Ian Hutchings",
   "rating": 5,
   "review_summary": "Clean Water",
   "review": "Great Swimming at Moira Lake. Perfect if you just want a cold water dip, leisurely swim or train for longer distances (3 laps of the circuit = 1km). Water is fresh and clean. A hot Cup of Tea/ Coffee is included in the price."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-04",
   "customer_name": "Catherine  Rojas",
   "rating": 5,
   "review_summary": "Great place ",
   "review": "Definitely recommend "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-09-02",
   "customer_name": "Marie Anne FORESTER",
   "rating": 5,
   "review_summary": "Thoroughly enjoyed my first experience doing open water swimming",
   "review": "Loved it"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-01",
   "customer_name": "Kevin Duffy",
   "rating": 5,
   "review_summary": "Family SUP experience (2 adults and 2 children, 1 * 12 and 1 * 10)",
   "review": "Absolutely loved our SUP experience. First time for us all - so enjoyable. Lovely warm welcome and brilliant coaches - we were all up after a matter of minutes. Really got a good introduction to SUP - boys took to it very quickly and want boards. Adults loved it - very peaceful and great way to relax and unwind, in a beautiful setting.Definitely recommend - will be having our son’s 11th birthday there in September."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-09-01",
   "customer_name": "Ali",
   "rating": 5,
   "review_summary": "A great experience ",
   "review": "Fantastic place, perfect for learning to paddleboard. The staff were great and the equipment provided was of a high quality. We'll definitely be back."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-31",
   "customer_name": "Andrea  Alderdice",
   "rating": 5,
   "review_summary": "SUP experience ",
   "review": "Fantastic time, on this beautiful little lake. The staff are so friendly and helpful. It is such a fun experience. Just love it. Totally recommend it."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-31",
   "customer_name": "Jill McMahon",
   "rating": 5,
   "review_summary": "2nd visit- great fun",
   "review": "My family and I had the best time at Moira lakes. Highly recommended as long as you don’t mind falling in a lot :) My 10 year old especially loved it! Good family fun and we can’t wait to go again:))"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-31",
   "customer_name": "Stephen",
   "rating": 5,
   "review_summary": "Excellent Facility",
   "review": "Moira Lakes is a great facility. The water is clean, the outside warm showers are great for after your swim, changing facilities and tea and coffee available.Easy to book and would definitely recommend a visit."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-30",
   "customer_name": "Lewis Chambers",
   "rating": 5,
   "review_summary": "Loved it!!",
   "review": "It's rare that we find something the whole family enjoys but this was it.Been twice and will definitely keep going.Changing rooms aren't the greatest but still good"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-27",
   "customer_name": "Stephen Murphy",
   "rating": 5,
   "review_summary": "Moira lakes Swim ",
   "review": "Lakes are cleanNo problems bookingI have recommended to other swimmers"
 },
 {
   "product": "Paddle Sports & Water Safety Training",
   "review_date": "2023-08-25",
   "customer_name": "Lesley Mulholland",
   "rating": 5,
   "review_summary": "Paddle and water sports safety course ",
   "review": "This was an excellent course and was enjoyed very much by my daughter would defiantly attend a course like this again.Staff were very helpful and friendly."
 },
 {
   "product": "Paddle Sports & Water Safety Training",
   "review_date": "2023-08-24",
   "customer_name": "Lynn Morrison",
   "rating": 5,
   "review_summary": "Brilliant course ",
   "review": "The boys both really enjoyed the course, with being 8 and 12 was great they could enjoy it together. They seemed to have learned a lot the day of the course and enjoyed both the theory and practical sides to the day. The course was easy to book and would highly recommend to friends and family"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-24",
   "customer_name": "Beverly Craig",
   "rating": 5,
   "review_summary": "Amazing ",
   "review": "Great fun for all the family, doesn't matter about the rain.Pizzas are great too! "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-24",
   "customer_name": "HEATHER REYNOLDS",
   "rating": 5,
   "review_summary": "Great day had by all",
   "review": "Very wet day didn't stop participants, they were very accommodating to spectators due to weather as we couldn't use picnic area."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-24",
   "customer_name": "Lesley Glenn",
   "rating": 5,
   "review_summary": "Swimming",
   "review": "The venue is great although the wee private road up to the entrance is full of pot holes and puddles! Enjoyed a lovely swim with fellow enthusiasts. It really helps to have sand at the entrance/exit of the lake. Loved the changing rooms but hooks to hang coats etc would be useful. Warm water hose to rinse down after our swim is appreciated, but so far from the changing rooms. Please could more showers be added nearer to the changing rooms? Loved the outdoor picnic tables and indoor seating for the complimentary cuppa afterwards. Enjoyed our visit and hope to be back soon! "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-24",
   "customer_name": "Dorothy Johnston ",
   "rating": 5,
   "review_summary": "First class",
   "review": "First class booking system The only thing I would like to see is if possible the under water weeds reduced Found swimming breaststroke difficult but I most certainly would recommend this facility "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-21",
   "customer_name": "Selina Myles",
   "rating": 5,
   "review_summary": "Great facilities ",
   "review": "Friendly and helpful staff. Clean excellent facilities.  The lake is clean and there is a lifeguard on duty. Easy booking. Great value for money. Definitely recommend this place. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-18",
   "customer_name": "Sharon Ramsden",
   "rating": 5,
   "review_summary": "Great facility and friendly staff",
   "review": "Clean and spacious changing areas, plenty of parking space and safe swimming facility with lifeguards present. Good facilities for a well earned post-swim refreshment afterwards."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-17",
   "customer_name": "Elizabeth  Gregg ",
   "rating": 5,
   "review_summary": "Excellent, clean and felt very safe.",
   "review": "Definitely  recommend  it especially  if you are just starting. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-17",
   "customer_name": "Andrew Vaughan",
   "rating": 5,
   "review_summary": "Lovely Swimming Spot",
   "review": "Very easy to book, great facilities to get changed before and after. Water was lovely, few weeds at the bottom but it is a lake. Definitely recommend it. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-16",
   "customer_name": "Lynne Girvan",
   "rating": 5,
   "review_summary": "Moira Lakes - Big Thumbs Up",
   "review": "My experience was very good.  Great to have this facility close to home.No issues at all booking or during my swimI have been recommending to all my friendsThank you "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-15",
   "customer_name": "sharon maguire ",
   "rating": 5,
   "review_summary": "Great experience ",
   "review": "Not over crowdedvery friendly staff"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-12",
   "customer_name": "Louise Nelson ",
   "rating": 5,
   "review_summary": "Paddle boarding ",
   "review": "We had a fantastic time out at moira lakes, very simply to book and staff were very pleasant and helpful when we arrived. I would definitely recommend as the girls had lots of fun."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-09",
   "customer_name": "RP",
   "rating": 5,
   "review_summary": "Brilliant day out",
   "review": "I brought my dad paddleboarding for his birthday and we loved it! Moira Lakes is very clean and beginner friendly. The staff were helpful and were always floating by to help with technique. Even the rain didn't ruin the fun"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-07",
   "customer_name": "Michal  Buchta",
   "rating": 5,
   "review_summary": "Brilliant place for swim",
   "review": "Clear water, friendly staff and cup of tea after swim."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-05",
   "customer_name": "Nuala Brazier ",
   "rating": 5,
   "review_summary": "Open water swimming ",
   "review": "The Area the privacy the facilities are all great.The staff very helpful. I would diffently recommend to others as I have already done so now there is a group of us going. 10 out of 10"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-08-04",
   "customer_name": "anon",
   "rating": 5,
   "review_summary": "Fantastic ",
   "review": "Really enjoyed the experience it was brilliant "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-03",
   "customer_name": "Stuart McElhinney",
   "rating": 5,
   "review_summary": "SUP",
   "review": "Great place to learn/practice SUP or just have some fun, took my 13yr old to try and had to book her and a friend in again within a week"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-02",
   "customer_name": "Nigel Crawford",
   "rating": 5,
   "review_summary": "Fantastic Experience ",
   "review": "Highly enjoyable fun and a great laugh my daughter and I had a brill night. Instructors really informative and helpful, we will go again! "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-08-02",
   "customer_name": "Cheryl Boyd",
   "rating": 5,
   "review_summary": "Enjoyable experience ",
   "review": "Thoroughly enjoyed my paddle boarding session.  It was my first time paddle boarding and it was great.  Great instructors and great equipment.  Everything was supplied.  It's a brilliant spot and would highly recommend it. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-31",
   "customer_name": "Gill Scott",
   "rating": 5,
   "review_summary": "Open swimming ",
   "review": "Excellent service and surroundings , we will be back thank you"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-31",
   "customer_name": "Deb Walker",
   "rating": 5,
   "review_summary": "Fantastic environment ",
   "review": "Came for my first experience of open swimming for years and it was amazing! From the simple to use booking system, easy parking, really friendly staff and other swimmers, clean changing facilities, hot showers and a free brew at the end. Aiming to swim here at least twice a week! Perfect "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-31",
   "customer_name": "Nicola  Dunne",
   "rating": 5,
   "review_summary": "Fun day out with the kids paddleboarding at Moira Lakes",
   "review": "Hi Thanks for a brilliant day @ Moira Lakes paddle boarding - myself and my girls had never been paddle boarding before. All the equipment and training is provided. The Lakes and changing rooms are very clean and the team in charge where brilliant. We all managed to stand on our boards. Would definitely recommend and great price for all included. "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-30",
   "customer_name": "AMANDA PATTERSON",
   "rating": 5,
   "review_summary": "Great fun",
   "review": "Great afternoons fun, staff were very attentive everyone had a brilliant time.Easy bookedDefinitely recommend Kids even ordered delicious pizzas after "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-28",
   "customer_name": "Ross Kelly",
   "rating": 5,
   "review_summary": "Superb experience & awesome fun",
   "review": "Very simple to book an experience & organise a slot, staff went over & above to make sure my group had everything they needed & where safe on the water. Also teaching some of the first timers to be more relaxed & confident in the board with standing up & some tips. Cant wait to go back & have already been recommending it to family & friends"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-28",
   "customer_name": "Christine  Mccaughey ",
   "rating": 5,
   "review_summary": "Fun for all",
   "review": "We had a family get together and absolutely amazing from the spectators to the participants we all thoroughly enjoyed ourselves.Looking forward to the next one.Oh and the pizza YUMMY "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-27",
   "customer_name": "Andrea  Alderdice",
   "rating": 5,
   "review_summary": "SUP experience ",
   "review": "Highly recommended, great family fun, my teenagers loved it. The staff were so helpful and friendly. We'll definitely be back."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-24",
   "customer_name": "Dwyer O'Hagan",
   "rating": 5,
   "review_summary": "Open water swimming ",
   "review": "Lovely venue and beautiful lake for swimming. Place is kept spotless and staff are friendly and helpful . Would recommend to all open water swimmers"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-22",
   "customer_name": "Harriet Johnston",
   "rating": 5,
   "review_summary": "Fabulous!",
   "review": "I love swimming at Moira Lakes. It is a safe space, swimming in the most beautiful location with the option of a heated shower and a hot drink afterwards!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-21",
   "customer_name": "Paula Wilkinson",
   "rating": 5,
   "review_summary": "Amazing ",
   "review": "We had a fab time and will definitely be back.  We had the best fun even in the rain. Staff lovely and really helpful."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-21",
   "customer_name": "Jill McMahon ",
   "rating": 5,
   "review_summary": "A great experience ",
   "review": "Loved every second of it. Great family fun. My youngest had already experienced it with her friend previously so she was so confident. It took us adults a few minutes to overcome the nerves, but once we did we were flying around the lake. We all ended up falling in at some point but it was easy enough to get back on the paddle board. It’s not law that you have to stand up, my eldest was happy to sit and paddle around as she couldn’t get past the nerves but she still had fun. We have booked to go again. Overall we recommend this experience. 5 stars"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-19",
   "customer_name": "Lynsey Rainey",
   "rating": 5,
   "review_summary": "Sup",
   "review": "Staff super helpful, facilities and experience all great. Thank you! "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-19",
   "customer_name": "Kathryn  McComiskey",
   "rating": 5,
   "review_summary": "Brilliant!",
   "review": "Second time doing SUP at Moira Lakes and it was every bit as good as the first.  Easy parking.  Everything’s provided.  Friendly instructors always around.  Best of all, this activity is not weather dependent!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-19",
   "customer_name": "Pippa Kirchmann",
   "rating": 5,
   "review_summary": "Great facility and great experience ",
   "review": "Really nice balance between tuition/safety and free time/fun and freedom to play! Great instruction and interaction from all the crew and instructors. Highly recommend!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-19",
   "customer_name": "Linda H",
   "rating": 5,
   "review_summary": "Great facility ",
   "review": "Great find, great set up, staff very friendly, lifeguard lake side at all times. Very enjoyable way to swim outdoors "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-18",
   "customer_name": "Kelly",
   "rating": 5,
   "review_summary": "Great local swimming spot",
   "review": "I had my first swim recently at Moira lakes, and it was a lovely experience. I’d definitely book again. The water felt really nice and the water quality was good too. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-18",
   "customer_name": "Regina Thompson",
   "rating": 5,
   "review_summary": "Fab experience! Will be back! ",
   "review": "First visit to Moira Lakes. Loved it! Super for open water swimming especially if you are going alone as lifeguard on duty at all times. Staff are so lovely & friendly. They couldn’t be more helpful! Extra bonus of hot showers & cuppa afterwards. Brilliant overall! "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-15",
   "customer_name": "Robert McGlade",
   "rating": 5,
   "review_summary": "Great facility.",
   "review": "Great safe and clean location for open water swimming. Nice cuppa from staff afterwards. Can't complain."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-15",
   "customer_name": "Amanda  ",
   "rating": 5,
   "review_summary": "Paddleboarding",
   "review": "A great start to the summer. All equipment was supplied and they were thorough with safety checks/awareness. For a never paddleboarder, the experience was great fun. We felt safe the whole time with the life guard out in the water too. He was helpful in teaching us some tricks too, like how to turn. Great value for money too.We'll definitely be back! And yes we would absolutely recommend to friends!!"
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-07-15",
   "customer_name": "FionaH",
   "rating": 5,
   "review_summary": "Swimmers Delight",
   "review": "Easy to book and pay.  Friendly staff.  Safety always comes first.  You can dip or swim.  Loved hot shower after esp on Solstice dawn swim morning."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-14",
   "customer_name": "YUV",
   "rating": 5,
   "review_summary": "Fantastic SUP experience ",
   "review": "We had a group of 8 first time paddle boarders in for a session which was a fantastic experience for everyone in the group!We had Very relaxed and good instructors helping us, certainly happy to see us have fun as well.Easy booking… all equipment supplied and spacious changing facilities.Various paddle board styles as well to test and the water was surprisingly warm."
 },
 {
   "product": "SUP - Bring Your Own Gear",
   "review_date": "2023-07-14",
   "customer_name": "Diane Hanna",
   "rating": 5,
   "review_summary": "Great afternoon fun ",
   "review": "Spent last Sunday afternoon there . Great place . Clean,  well run . I brought my own paddle board but in hindsight I would not be bothered doing this again . To pay £ 15.00 including the wet suit and board hire , value for money  . Will most definitely be back ."
 },
 {
   "product": "SUP - Bring Your Own Gear",
   "review_date": "2023-07-13",
   "customer_name": "Deb",
   "rating": 5,
   "review_summary": "Great safe location for SUP’s",
   "review": "This was the perfect place for our first time using our SUP’s. It was very safe and well supervised and staff were really friendly. The location is extremely picturesque and we will definitely be back. Booking couldn’t have been easier and I will be recommending to friends."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-12",
   "customer_name": "Lisa  T",
   "rating": 5,
   "review_summary": "What a gem!",
   "review": "Spent a really enjoyable evening at Moria Lakes for my first SUP experience. Amazing facilities, everything spotlessly clean and organised. We were welcomed well and staff both on and off the lake we both professional and friendly encouraging. Brilliant value for money and something different to experience. Looking forward to our next trip! Many thanks."
 },
 {
   "product": "SUP - Bring Your Own Gear",
   "review_date": "2023-07-12",
   "customer_name": "Catherine  McCracken ",
   "rating": 5,
   "review_summary": "Brilliant wee evening",
   "review": "All the staff were very helpful, friendly and welcoming :-) The weather being like Ibiza of course helped and lovely to get to chillax afterwards with a cuppa… Thank-you everyone at Moira Lakes :-)"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-12",
   "customer_name": "Steve Powell",
   "rating": 5,
   "review_summary": "Superb venue. Helpful staff. Lovely evenings swimming!",
   "review": "Yes"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-11",
   "customer_name": "BG",
   "rating": 5,
   "review_summary": "Birthday Treat",
   "review": "Well organised, clear safety brief and clean changing rooms"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-11",
   "customer_name": "Stephen Murphy",
   "rating": 5,
   "review_summary": "In for a outdoor swim",
   "review": "Moira Lakes is perfectClean Lake, clean changing Rooms, clean tables and chairs.Warm Showers and great coffee.Every member of staff knows how to look after their Customers."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-09",
   "customer_name": "Paddy McConnell",
   "rating": 5,
   "review_summary": "Summer solstice swim ",
   "review": "Very therapeutic swim in the fresh water lake and a once in a lifetime beautiful summer solstice swim at 4.15 am. Fully recommend this experience."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-08",
   "customer_name": "Claire P",
   "rating": 5,
   "review_summary": "Family fun",
   "review": "Took our two kids age 4 & 6 who enjoyed slashing in the beach area, and myself and husband were able to take turns open water swimming - fab spot on a beautiful evening!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-08",
   "customer_name": "Bobby McGlade ",
   "rating": 5,
   "review_summary": "Excellent swim location.",
   "review": "Only been once but will definitely be back once a leg wound has healed. I swim in the sea and used to use Lough Neagh, but the Lough is a bit ropey with grime and algae in summer. The water here is very clear and inviting. I found the water temperature ideal and the lake is big enough to ensure plenty of swim room for all. Seems very friendly crowd and would hope to make a few contacts during future visits."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-07",
   "customer_name": "Kirsty Dunlop",
   "rating": 5,
   "review_summary": "Great venue for open water swimming",
   "review": "Really great place - good changing facilities and very friendly staff.I would love it if there were earlier morning swim sessions available. "
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-07-06",
   "customer_name": "Harriet Johnston",
   "rating": 5,
   "review_summary": "Fantastic experience!",
   "review": "This is the 2nd time my friends and I have done the summer solstice swim. It's really well run and is an invigorating experience!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-04",
   "customer_name": "Julie-Anne Stagg",
   "rating": 5,
   "review_summary": "Group of teens",
   "review": "We took a group of 13 teens aged 16/17 for the full SUP experience, they had a ball. Kitted out quickly with plenty of facility to change, on water they had great guidance and a ball - the bit they enjoyed the most was the giant SUP where they all got to jump on! Water was so clean and they told us warm - we will be back!!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-03",
   "customer_name": "Claire Johnston",
   "rating": 5,
   "review_summary": "Early Morning Swim",
   "review": "My mum & I took part in the (very) early morning summer solstice swim. I must say though, we both thoroughly enjoyed it. The facilities here are great and the staff are incredibly friendly. Would highly recommend to anyone to check this place out. We will definitely be back "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-02",
   "customer_name": "Anon",
   "rating": 5,
   "review_summary": "Open water swimming starts here",
   "review": "First time open water swimming  . Moira Lakes is a good place to start. Helpful staff and beautiful setting . Easy booking system . There are some benches and tables on site. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-07-01",
   "customer_name": "Aine McNeill ",
   "rating": 5,
   "review_summary": "Great time at Moira Lakes.",
   "review": "Lovely place. Comfortable swim. Felt safe. Nice warm shower after. Easy to book. Road access a little bumpy bot would definitely recommend. "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-07-01",
   "customer_name": "Astra McNicholl",
   "rating": 5,
   "review_summary": "Fantastic fun for a group activity!",
   "review": "My friends and I booked for a fun summer activity. We had adults and kids from 6 - 48 and some not-very-confident swimmers too. The coach was patient and clear whilst also making sure the kids had space to mess about and have a laugh too. Some of us adults got a bit of extra coaching on turning and safety practices which was great. All round a super fun activity for complete beginners and something different :) We all said we'd come back!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-29",
   "customer_name": "Sarah Henry",
   "rating": 5,
   "review_summary": "Fun in the sun ",
   "review": "Brilliant afternoon out. Staff were friendly and helpful. The facilities were super clean and the paddle boarding was so much fun for all ages! "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-28",
   "customer_name": "Jonny McCarthy",
   "rating": 5,
   "review_summary": "Great Experience ",
   "review": "Great instructors, great equipment and great instructors. Highly recommend "
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-06-27",
   "customer_name": "michelle towe",
   "rating": 5,
   "review_summary": "Brilliant event",
   "review": "Well organised and very enjoyable. Would have been lovely to see a nice sunrise but that can't be planned for. Would definitely recommend "
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-06-26",
   "customer_name": "Anthony Molloy",
   "rating": 5,
   "review_summary": "Amazing experience ",
   "review": "Class experience, really well run and memories I will have for a long time "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-26",
   "customer_name": "Johnny ",
   "rating": 5,
   "review_summary": "Outdoors swimming i",
   "review": "A pleasantly warm experience in a lake thats roughly 3 times the size of an Olympic swimming pool. Totally outdoors, variable depth but usually at least 5 feet deep after you get in - deeper in places. You need to bring your own outdoor swimming float and I would say you don't need a wetsuit during warmer months at least. As long as you're an OK swimmer you'll be able to have fun! Pondweed at bottom which may tickle your feet, not many critters in water and is very well maintained and chill. Can do laps if you want, or just float around."
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-06-26",
   "customer_name": "Ian Withers",
   "rating": 5,
   "review_summary": "Great Experience",
   "review": "This was a great experience and, whilst the Sun did not burst over the horizon due to some low cloud, it was still a fantastic swim in warm 20 degrees water.  The breakfast croissant helped too. Thanks to Martin and his team for a lovely start to the day."
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-06-26",
   "customer_name": "Lynda  Abrahall",
   "rating": 5,
   "review_summary": "Absolutely brilliant. ",
   "review": "An absolutely fantastic event, well organised, friendly & welcoming team with great facilities. Would definitely recommend Moira Lakes so lucky to have this in our local area. "
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-06-26",
   "customer_name": "Anonymous ",
   "rating": 5,
   "review_summary": "Excellent!",
   "review": "I loved the summer solstice swim!!  Was so peaceful and just what I needed.Would love a monthly early swim session!"
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-06-26",
   "customer_name": "Sarah  ",
   "rating": 5,
   "review_summary": "Solstice energy!",
   "review": "Such a fabulous event for a great cause. Serene, yet full of camaraderie. So well organised and the coffee & croissants were delicious. Well done to all involved!I never even knew there were lakes in Moira!Looking forward to the next one!"
 },
 {
   "product": "Summer Solstice Sunrise Swim in aid of Angel Wishes",
   "review_date": "2023-06-26",
   "customer_name": "Suzanne Murty",
   "rating": 5,
   "review_summary": "Brilliant event .Amazing charity",
   "review": "Brilliant event for an amazing charityThank you"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-24",
   "customer_name": "Rachel Rowe",
   "rating": 5,
   "review_summary": "First visit",
   "review": "First visit to Moira lakes last week. Staff were very welcoming. Facilities were great and it's a lovely venue. Really enjoyed our swim and will definitely be back."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-24",
   "customer_name": "Lee",
   "rating": 5,
   "review_summary": "Great time SUP-ing",
   "review": "Really enjoyed the SUP experience. Absolute bargain at £15 for an hour and a half, with all equipment included. It all felt really safe, and there was good atmosphere in the group. I would recommend to friends or families with kids - a great outdoor experience, with lots of laughter. Give it a go!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-23",
   "customer_name": "Declan  Liddy",
   "rating": 5,
   "review_summary": "Worth the money ",
   "review": "The booking was easy. all staff were friendly and helpful. The children loved the paddle boarding and Pizza. Thank you"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-22",
   "customer_name": "Melissa  Lawson",
   "rating": 5,
   "review_summary": "Open water swim ",
   "review": "My friend and I done the open water swim! It was absolutely fabulous. I have never done anything like this before and I left feeling amazing. The swim was great and everyone so friendly from the people at reception to the people around the water. The area is beautiful and so close to my home which a great bonus. One word wow! Definitely be back again and again and recommend to anyone. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-21",
   "customer_name": "Ursula Irwin",
   "rating": 5,
   "review_summary": "Open water swim",
   "review": "Great set up and facilities. Enjoyed my swim very much. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-20",
   "customer_name": "Fiona Hart",
   "rating": 5,
   "review_summary": "Safe for a dip, lovely staff, great facilities",
   "review": "Highly recommend Moira Lakes for a safe, friendly dip."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-19",
   "customer_name": "Karen Scott ",
   "rating": 5,
   "review_summary": "Fantastic first visit to Moira Lakes",
   "review": "Loved our first outing to Moira Lakes, easy to book, friendly staff, good facilities, lovely lake for swimming in - really enjoyed it! And the cuppa afterwards is the icing on the cake! We had planned a return visit this evening, but thunder and lightning has postponed our return! But will definitely go again, great to have this lovely local amenity!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-19",
   "customer_name": "Linda H",
   "rating": 5,
   "review_summary": "Open water swimming ",
   "review": "First time visitor, first time proper open water swim! And I loved it. Whole set up is great, staff very friendly and helpful! I'll be booking in again very soon!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-19",
   "customer_name": "NIALL MCCONNELL",
   "rating": 5,
   "review_summary": "First experience of open water swimming",
   "review": "Moira lakes is great, clean, clear, well supervised and with friendly owners. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-17",
   "customer_name": "Catherine  King",
   "rating": 5,
   "review_summary": "Best for open water",
   "review": "Staff so helpful and friendlyExcellent facilities showers and changing roomsWater crystal clear Felt safe in water great experience "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-17",
   "customer_name": "DAVID WRIGHT",
   "rating": 5,
   "review_summary": "Best Open Water experience. ",
   "review": "I had a fantastic time at Moira Lakes.Great parking and only a 20 minute drive from home. The main lake is big with plenty of space to swim.Very clean water indeed and not as cold as the Open Sea.One hour spent in the water was great value for money at £5.Also provided was great changing and showers with a free coffee to go.I will definitely be back soon.David"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-16",
   "customer_name": "Christopher Moore",
   "rating": 5,
   "review_summary": "Brilliant",
   "review": "Brilliant fun, great staff!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-16",
   "customer_name": "Anthony Wells",
   "rating": 5,
   "review_summary": "First time trying paddle boarding. Great day spent with my family. Will be back",
   "review": "Would recommwnd this place to friends."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-15",
   "customer_name": "Cheets",
   "rating": 5,
   "review_summary": "First time SUP",
   "review": "This was our first time. Very friendly helpful staff, there straight away if needed, all the equipment you need. Just got to get over the fact you will probably get wet...Very nice ice cream! "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-12",
   "customer_name": "Jonny Martin",
   "rating": 5,
   "review_summary": "Very enjoyable experience ",
   "review": "The open water swimming is fantastic. Great facilities and the water is very clean and pleasant to swim in. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-11",
   "customer_name": "Carol Newman",
   "rating": 5,
   "review_summary": "What a find",
   "review": "Love this little spot, it’s like a little oasis in the middle of nowhere. There is paddle boarding as well as swimming but I love the swimming as the water can be warm in summer but also it’s very very clean.Have recommended it to loads of friends. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-10",
   "customer_name": "Linda  Pickering ",
   "rating": 5,
   "review_summary": "Evening swim",
   "review": "I loved it and the fact that if you need to go on your own it's safe to do so. Of coarse the beautiful sunshine was a bonus! Would definitely like more swim sessions to be added. "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-09",
   "customer_name": "Shannon Mcgeown",
   "rating": 5,
   "review_summary": "Sup ",
   "review": "The most perfect afternoon all staff were so helpful and friendly such a lovely experience we had, we will definitely be back. "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-09",
   "customer_name": "Heather  Larmour ",
   "rating": 5,
   "review_summary": "First time experience at Moira Lakes",
   "review": "Last Sunday I booked a full SUP experience for my daughter and I. We had previously tried paddle boarding in the sea and so my daughter was reluctant to go again, but as soon as we got on the crystal clear waters of Moira Lakes we had an incredible time! The water was so calm, clean and delightful that you didn't mind falling in one bit! Every member of staff was extremely friendly and made the experience so enjoyable. We will be back very soon! "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-08",
   "customer_name": "Ger Lennon ",
   "rating": 5,
   "review_summary": "First time SUP",
   "review": "We had a great time on our first try out at SUP in Moira Lakes. Lovely staff and good equipment along with a great facility in brilliant weather. We can truly recommend."
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-08",
   "customer_name": "Jim Burnside ",
   "rating": 5,
   "review_summary": "First timers",
   "review": "Great experience. My wife and i decided to try it out after many months of saying we'll have to try this out. Def be back. I took a star off for value. We have our own tow floats but the lakes will rent you one. Personally i think £5 to rent is very steep when a swim is £5. £1 or £2 is fine or a £5 returnable deposit."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-02",
   "customer_name": "ROBERT ",
   "rating": 5,
   "review_summary": "Excellent ",
   "review": "Excellent facilities, equipment and instruction. Good value for money, though a discounted family ticket for three plus would make it even better! Friendly and knowledgeable staff. Would recommend SUP at Moira Lakes. "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-06-02",
   "customer_name": "Declan  McClure ",
   "rating": 5,
   "review_summary": "Excellent ",
   "review": "Everything about Moira lakes is excellent. From the fun and friendly staff who are on hand to give advice to the overall facilities. We had a great time here. Perfect for learning and practising. Would definitely recommend to anyone looking to learn how to paddleboard or to practice "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-06-01",
   "customer_name": "Jonny Martin",
   "rating": 5,
   "review_summary": "Great venue",
   "review": "Really great place for an outdoor swim! The water was very clean and the facilities are great"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-05-29",
   "customer_name": "A West",
   "rating": 5,
   "review_summary": "Awesome ",
   "review": "Friendly, safe and crystal clear water. Great fun and such an amazing place to gain confidence in open water swimming. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-05-29",
   "customer_name": "Anthony Molloy",
   "rating": 5,
   "review_summary": "Superb ",
   "review": "Superb place to swim..  tranquil and relaxing and very clean. "
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-05-26",
   "customer_name": "Declan",
   "rating": 5,
   "review_summary": "Teenage son",
   "review": "Took my son for 13th birthday and he had the best time! Asked him about writing a review and it was - brilliant, loved it! He can’t wait to go back!"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-05-25",
   "customer_name": "Ian Mcilveen",
   "rating": 5,
   "review_summary": "Open water swim",
   "review": "New location for me, family, friends to open water swim, had been using lets go hydra, Carryduff. But this area is easier to get to, clean water , warmer! also very friendly staff and ease of booking online. The only addition I would like, is some type of anchored buoy at each corner of lake for sighting and possible measured distances. "
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-05-18",
   "customer_name": "Alison Matthews ",
   "rating": 5,
   "review_summary": "Moira foodbank swim",
   "review": "Lovely of Moira lakes to organise charity swim in aid of Moira foodbank. 1st time swimming there and had a very warm welcome , great facilities in general and an added bonus to have Mourne hot barrel sauna there. Im a Moira woman so great to see this facility on my doorstep.I'll def be back for swimming and to try out your paddle boarding sessions . Highly recommend"
 },
 {
   "product": "Open Water Swimming",
   "review_date": "2023-05-18",
   "customer_name": "Karen",
   "rating": 5,
   "review_summary": "Lovely spot for a swim",
   "review": "Online booking was easy, water was lovely. “Beach” area for walk in entry, hot outside shower to rinse off. Staff were friendly and helpful. I will definitely be back. "
 },
 {
   "product": "SUP - Bring Your Own Gear",
   "review_date": "2023-05-14",
   "customer_name": "Julie Curran ",
   "rating": 5,
   "review_summary": "Great day",
   "review": "Friendly patient staff.Really enjoyable experience.....staff even helped pumped up board cos I'm such a novice.!!!Had a really great morning would absolutely come again.  "
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-05-12",
   "customer_name": "Sarahlouise Bradford",
   "rating": 5,
   "review_summary": "Get it booked!",
   "review": "Brilliant morning, nice peaceful location and very clean water.  Went for the full sup experience.  Just turned up with our swim suits and the guys supplied the rest.  The instructor couldn't have been nicer and give plenty of tips to help us.  I would highly recommend and will be back again."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-05-06",
   "customer_name": "Jonathan D",
   "rating": 5,
   "review_summary": "Great experience for first-time SUPers",
   "review": "Great experience at Moira Lakes for a family of 4. Treated very well from booking through to the day and the staff were very friendly and helpful on the day. Our paddleboarding guide was very helpful when we got out on the water and we had an enjoyable session. We will definitely be back."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-05-05",
   "customer_name": "Catherine  MacDonald ",
   "rating": 5,
   "review_summary": "Paddle Boarding ",
   "review": "Great spot and all staff were so friendly and helpful. Will definitely be back to try something else!"
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-29",
   "customer_name": "Caroline McCann",
   "rating": 5,
   "review_summary": "Charity Dip",
   "review": "Fantastic morning with a great setup and the sauna was amazing!!Thank you everyone for the opportunity x"
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-28",
   "customer_name": "Noleen  Oneill ",
   "rating": 5,
   "review_summary": "Swim at Moira Lakes",
   "review": "Moira lakes is a wonderful place, staff are all so friendly and helpful. I took part in their charity dip and it was so good. Great facility, a hot tea and blazing fire to warm us up afterwards. Booking is easy and I would definitely recommend to friends. Thanks "
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-28",
   "customer_name": "Karen  McRobert ",
   "rating": 5,
   "review_summary": "Well Organised Event",
   "review": "Such a well organised event with plenty of friendly staff available to assist. Greeted at reception by friendly staff who told us about water temperature and changing / shower facilities. Changing rooms were clean and spacious. The log cabin for refreshments is a fantastic set up. The hot sauna just added that special something to the day and a fantastic way to relax after the swim. The lake itself was so clean and calm it was pleasant to swim on with no reeds. You can tell the lake is well maintained. I will definitely be back and have already been recommended to several of my swim buddies. "
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-28",
   "customer_name": "Diane  Durr",
   "rating": 5,
   "review_summary": "Great experience ",
   "review": "This was our first visit to Moira Lakes and it really was as a feeler for a corporate event that we’re trying to organise.The people are so friendly, it’s well organised and the water is well observed by lifeguards. Facilities are great for an outdoor swim. We will definitely visit again "
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-28",
   "customer_name": "Glynis Hobson",
   "rating": 5,
   "review_summary": "Great day for a great cause ",
   "review": "Beautiful venue, crystal clear water warm showers and a cuppa to follow m. Bliss"
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-28",
   "customer_name": "Carol  Newman ",
   "rating": 5,
   "review_summary": "Santa swim ",
   "review": "Thoroughly enjoyed the ‘Santa’ swim in Moira Lakes & then a sauna afterwards. Started coming last year & I must say the lake is very clean & the staff are very friendly & accommodating. "
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-28",
   "customer_name": "MaryRose  Martin ",
   "rating": 5,
   "review_summary": "Charity swim review ",
   "review": "Would absolutely do this again on a regular basis, the option of the sauna was fantastic!"
 },
 {
   "product": "Moira Foodbank Charity Event!!",
   "review_date": "2023-04-28",
   "customer_name": "Emma Thompson",
   "rating": 5,
   "review_summary": "Sauna and Swim",
   "review": "Amazing! Loved it"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-04-27",
   "customer_name": "Laura ",
   "rating": 5,
   "review_summary": "So much fun!!! ",
   "review": "We went a group of 3, it was so much fun! The instructor put us all at ease straight away especially as one of us wasn’t a strong swimmer. You don’t need to swim to paddle board! We had the most amazing experience and will back!!"
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-04-20",
   "customer_name": "Judith Linton",
   "rating": 5,
   "review_summary": "Birthday fun",
   "review": "Great, fun activity for my daughter’s birthday. The staff were great - couldn’t be more helpful."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-04-13",
   "customer_name": "Tony McVeigh",
   "rating": 5,
   "review_summary": "First Time Experience",
   "review": "A great facility, with very polite and helpful staff, shown constant support throughout our experience on the water. And would highly recommend this activity aswell as the lakes to everyone of all ages. Look forward to returning."
 },
 {
   "product": "Full SUP Experience",
   "review_date": "2023-04-11",
   "customer_name": "alison reid",
   "rating": 5,
   "review_summary": "a wonderful morning spent at Moira Lakes",
   "review": "This is such a beautiful spot, all the staff are awesome, Aidan our instructor was patient, friendly and understanding. I would encourage everyone regardless of age or fitness to come and spend a morning or a day, we bookes another slot within an hour of coming home"
 }
]